// 1.	L801 დაწერეთ ფუნქცია რომელიც დააბრუნებს promise-ს რომელიც 10 წამის დაყოვნების
// შემდეგ სრულდება წარმატებით და აბრუნებს მიმდინარე დროიდან აღებულ წუთებს თუ მიმდინარე
// დროიდან აღებული წუთები ლუწია, და შეცდომით („არაკორექტული დრო“) როდესაც მიმდინარე
// დროიდან აღებული წუთები კენტია. მაგალითად თუ ფუნქციის გამოძახებისას იყო 15:55:50, 10
// წამის შემდგე იქნება 15:56:00, 56 ლუწი რიცხვია ამიტომ უნდა დასრულდეს წარმატებით და
// დააბრუნის 56.

let promise = new Promise((resolve, reject) =>
{
    setTimeout(() =>
    {
        let minute = new Date().getMinutes();
        if (minute % 2 == 0)
        {
            resolve(minute);
        }
        else reject('არაკორექტული დრო');
    }, 10000);
});

promise.then(
    result => alert('შედეგი: '+result),
    error => alert('შეცდომა: '+error)
)